I just added a 3rd node to my proxmox cluster and so copied the vm definition in my terraform config one more time, edited the vm name and target node name and applied that. Was surprised it was saying it wanted to modify the 2 existing vms as well as create 1 new one but I let it continue. It has created the 3rd vm as intended on the correct node but a similar set of errors has been produced with the plugin crashing.

```
james@Terraform:~/Terraform/dockertest$ terraform apply
proxmox_vm_qemu.dockertest_vm: Refreshing state... [id=proxmox1/qemu/112]
proxmox_vm_qemu.dockertest_vm2: Refreshing state... [id=proxmox2/qemu/111]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_vm_qemu.dockertest_vm will be updated in-place
  ~ resource "proxmox_vm_qemu" "dockertest_vm" {
        id                        = "proxmox1/qemu/112"
        name                      = "dockertest-node"
      - tags                      = " " -> null
        # (54 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.dockertest_vm2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "dockertest_vm2" {
        id                        = "proxmox2/qemu/111"
        name                      = "dockertest-node2"
      - tags                      = " " -> null
        # (54 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.dockertest_vm3 will be created
  + resource "proxmox_vm_qemu" "dockertest_vm3" {
      + additional_wait           = 5
      + agent                     = 1
      + agent_timeout             = 90
      + automatic_reboot          = true
      + automatic_reboot_severity = "error"
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=scsi0"
      + bootdisk                  = (known after apply)
      + cicustom                  = "user=Proxmox_Templates_ISOs_NFS:snippets/cloud_init_test1.yml"
      + ciupgrade                 = false
      + clone                     = "ubuntu-cloud"
      + clone_wait                = 10
      + current_node              = (known after apply)
      + default_ipv4_address      = (known after apply)
      + default_ipv6_address      = (known after apply)
      + define_connection_info    = true
      + description               = "Managed by Terraform."
      + force_create              = false
      + full_clone                = true
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + linked_vmid               = (known after apply)
      + memory                    = 2048
      + name                      = "dockertest-node3"
      + onboot                    = false
      + os_type                   = "cloud-init"
      + protection                = false
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-single"
      + skip_ipv4                 = false
      + skip_ipv6                 = true
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            [REDACTED]
        EOT
      + tablet                    = true
      + target_node               = "proxmox3"
      + unused_disk               = (known after apply)
      + vm_state                  = "running"
      + vmid                      = (known after apply)

      + cpu {
          + cores   = 2
          + limit   = 0
          + numa    = false
          + sockets = 1
          + type    = "host"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide3 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + discard              = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "15G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

proxmox_vm_qemu.dockertest_vm3: Creating...
proxmox_vm_qemu.dockertest_vm: Modifying... [id=proxmox1/qemu/112]
proxmox_vm_qemu.dockertest_vm2: Modifying... [id=proxmox2/qemu/111]
proxmox_vm_qemu.dockertest_vm3: Still creating... [00m10s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 00m10s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 00m10s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [00m20s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 00m20s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 00m20s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [00m30s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 00m30s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 00m30s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [00m40s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 00m40s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 00m40s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [00m50s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 00m50s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 00m50s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [01m00s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 01m00s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 01m00s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [01m10s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 01m10s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 01m10s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [01m20s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 01m20s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 01m20s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [01m30s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 01m30s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 01m30s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [01m40s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 01m40s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 01m40s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [01m50s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 01m50s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 01m50s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [02m00s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 02m00s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 02m00s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [02m10s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 02m10s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 02m10s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [02m20s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 02m20s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 02m20s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [02m30s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 02m30s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 02m30s elapsed]
proxmox_vm_qemu.dockertest_vm3: Still creating... [02m40s elapsed]
proxmox_vm_qemu.dockertest_vm: Still modifying... [id=proxmox1/qemu/112, 02m40s elapsed]
proxmox_vm_qemu.dockertest_vm2: Still modifying... [id=proxmox2/qemu/111, 02m40s elapsed]
proxmox_vm_qemu.dockertest_vm3: Creation complete after 2m46s [id=proxmox3/qemu/113]
\u2577
\u2502 Error: Plugin did not respond
\u2502 
\u2502   with proxmox_vm_qemu.dockertest_vm,
\u2502   on main.tf line 26, in resource "proxmox_vm_qemu" "dockertest_vm":
\u2502   26: resource "proxmox_vm_qemu" "dockertest_vm" {
\u2502 
\u2502 The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange call. The plugin logs may contain more details.
\u2575
\u2577
\u2502 Error: Plugin did not respond
\u2502 
\u2502   with proxmox_vm_qemu.dockertest_vm2,
\u2502   on main.tf line 93, in resource "proxmox_vm_qemu" "dockertest_vm2":
\u2502   93: resource "proxmox_vm_qemu" "dockertest_vm2" {
\u2502 
\u2502 The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange call. The plugin logs may contain more details.
\u2575

Stack trace from the terraform-provider-proxmox_v3.0.2-rc05 plugin:

panic: interface conversion: interface {} is nil, not string

goroutine 16 [running]:
github.com/Telmate/proxmox-api-go/proxmox.(*ConfigQemu).mapToStruct(0xc0001783c0, 0xc000e96460?, 0xc0010937d0)
	github.com/Telmate/proxmox-api-go@v0.0.0-20251016192144-4a331a14ad5c/proxmox/config__qemu.go:398 +0x1414
github.com/Telmate/proxmox-api-go/proxmox.(*rawConfigQemu).get(0xc001b02e68, 0xc000e96460)
	github.com/Telmate/proxmox-api-go@v0.0.0-20251016192144-4a331a14ad5c/proxmox/config__qemu.go:1149 +0x4a5
github.com/Telmate/proxmox-api-go/proxmox.(*rawConfigQemu).Get(0xc001282ea0?, 0xf26a49?)
	github.com/Telmate/proxmox-api-go@v0.0.0-20251016192144-4a331a14ad5c/proxmox/config__qemu.go:1123 +0x13
github.com/Telmate/terraform-provider-proxmox/v2/proxmox.resourceVmQemuRead({0x108b6d8, 0xc00020e770}, 0xc001282ea0, {0xd6dea0?, 0xc00047ad20})
	github.com/Telmate/terraform-provider-proxmox/v2/proxmox/resource_vm_qemu.go:997 +0x77c
github.com/Telmate/terraform-provider-proxmox/v2/proxmox.resourceVmQemuUpdate({0x108b6d8, 0xc00020e770}, 0xc001282ea0, {0xd6dea0, 0xc00047ad20})
	github.com/Telmate/terraform-provider-proxmox/v2/proxmox/resource_vm_qemu.go:948 +0x25f2
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).update(0xc000257800, {0x108b630, 0xc000c54bd0}, 0xc001282ea0, {0xd6dea0, 0xc00047ad20})
	github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/schema/resource.go:883 +0x119
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0xc000257800, {0x108b630, 0xc000c54bd0}, 0xc000a7a1a0, 0xc00104c360, {0xd6dea0, 0xc00047ad20})
	github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/schema/resource.go:990 +0x8f3
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ApplyResourceChange(0xc00012e2d0, {0x108b630?, 0xc000c54b10?}, 0xc00024abe0)
	github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/schema/grpc_provider.go:1484 +0x1085
github.com/hashicorp/terraform-plugin-go/tfprotov5/tf5server.(*server).ApplyResourceChange(0xc000276000, {0x108b630?, 0xc000c54210?}, 0xc000176180)
	github.com/hashicorp/terraform-plugin-go@v0.28.0/tfprotov5/tf5server/server.go:941 +0x3b9
github.com/hashicorp/terraform-plugin-go/tfprotov5/internal/tfplugin5._Provider_ApplyResourceChange_Handler({0xefdb20, 0xc000276000}, {0x108b630, 0xc000c54210}, 0xc000176100, 0x0)
	github.com/hashicorp/terraform-plugin-go@v0.28.0/tfprotov5/internal/tfplugin5/tfplugin5_grpc.pb.go:687 +0x1a6
google.golang.org/grpc.(*Server).processUnaryRPC(0xc000382000, {0x108b630, 0xc000c54150}, 0xc0001167e0, 0xc00076b0e0, 0x1729fe8, 0x0)
	google.golang.org/grpc@v1.72.1/server.go:1405 +0x1036
google.golang.org/grpc.(*Server).handleStream(0xc000382000, {0x108c010, 0xc000858000}, 0xc0001167e0)
	google.golang.org/grpc@v1.72.1/server.go:1815 +0xb88
google.golang.org/grpc.(*Server).serveStreams.func2.1()
	google.golang.org/grpc@v1.72.1/server.go:1035 +0x7f
created by google.golang.org/grpc.(*Server).serveStreams.func2 in goroutine 36
	google.golang.org/grpc@v1.72.1/server.go:1046 +0x11d

Error: The terraform-provider-proxmox_v3.0.2-rc05 plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.

```

JSON from the first 2 VMs and the newly created VM in case it helps you as they will match this run now:

Node 1, VM1
```
{"data":{"cpu":"host","balloon":0,"cores":2,"protection":0,"cicustom":"user=Proxmox_Templates_ISOs_NFS:snippets/cloud_init_test1.yml","ipconfig0":"ip=dhcp","smbios1":"uuid=69790041-5d80-4322-9c0b-d092ca0d0933","boot":"order=scsi0","onboot":0,"serial0":"socket","tags":" ","hotplug":"network,disk,usb","ciupgrade":0,"memory":"2048","agent":"1","kvm":1,"net0":"virtio=BC:24:11:8F:2A:62,bridge=vmbr0","scsihw":"virtio-scsi-single","vmgenid":"9c2a393e-875d-49aa-98b9-267d0b171899","numa":0,"vga":"type=serial0","scsi0":"local-lvm:vm-112-disk-0,discard=on,iothread=1,replicate=0,size=15G","sshkeys":"[REDACTED]","tablet":1,"name":"dockertest-node","meta":"creation-qemu=10.1.2,ctime=1762465566","digest":"a55d2896a0c8b33427145288fad7e7202009e282","sockets":1,"bios":"seabios","ide3":"local-lvm:vm-112-cloudinit,media=cdrom","description":"Managed by Terraform."}}
```

Node 2, VM2
```
{"data":{"bios":"seabios","memory":"2048","meta":"creation-qemu=10.1.2,ctime=1762465566","numa":0,"tablet":1,"boot":"order=scsi0","agent":"1","protection":0,"sshkeys":"[REDACTED]","kvm":1,"vga":"type=serial0","scsi0":"data2:vm-111-disk-0,discard=on,iothread=1,replicate=0,size=15G","serial0":"socket","vmgenid":"99f2d301-76c6-4be2-bb77-f2412b4973a5","cores":2,"digest":"0e75c94eaaee7216f09f0a655cee8136e4ccdd22","tags":" ","description":"Managed by Terraform.","scsihw":"virtio-scsi-single","name":"dockertest-node2","ipconfig0":"ip=dhcp","net0":"virtio=BC:24:11:DF:A5:7F,bridge=vmbr0","onboot":0,"balloon":0,"ide3":"local-lvm:vm-111-cloudinit,media=cdrom","smbios1":"uuid=93869260-10e3-4013-a870-3a8340189f34","cicustom":"user=Proxmox_Templates_ISOs_NFS:snippets/cloud_init_test1.yml","ostype":"other","hotplug":"network,disk,usb","cpu":"host","sockets":1,"ciupgrade":0}}
```

Node 3, VM3
```
{"data":{"net0":"virtio=BC:24:11:7A:A5:2A,bridge=vmbr0","agent":"1","smbios1":"uuid=d1e5d6d4-56ce-4107-a0f2-714ce6a29987","cpu":"host","protection":0,"serial0":"socket","cicustom":"user=Proxmox_Templates_ISOs_NFS:snippets/cloud_init_test1.yml","memory":"2048","hotplug":"network,disk,usb","balloon":0,"tags":" ","ipconfig0":"ip=dhcp","ciupgrade":0,"sshkeys":"[REDACTED]","kvm":1,"onboot":0,"sockets":1,"vga":"type=serial0","scsihw":"virtio-scsi-single","cores":2,"vmgenid":"7e72fb4b-84f6-46c6-9b89-dbe35e437b6d","meta":"creation-qemu=10.1.2,ctime=1762465566","scsi0":"local-lvm:vm-113-disk-0,discard=on,iothread=1,replicate=0,size=15G","bios":"seabios","digest":"9d754f8b32d737d90e6438b4c56f9155cc89d898","numa":0,"boot":"order=scsi0","name":"dockertest-node3","ide3":"local-lvm:vm-113-cloudinit,media=cdrom","description":"Managed by Terraform.","tablet":1}}
```

Terraform config file in case usefull:
```
terraform {
  required_providers {
    proxmox = {
      source  = "Telmate/proxmox"
      #version = "3.0.1-rc3" # Or latest available
      version = "3.0.2-rc05"
    }
  }
}

provider "proxmox" {
  pm_api_url = "https://10.12.1.36:8006/api2/json"

  pm_api_token_id = "terraform@pam!Terraform"
  pm_api_token_secret = "[REDACTED]"
  pm_tls_insecure = true           # if your Proxmox uses self-signed certs
}

resource "proxmox_vm_qemu" "dockertest_vm" {
  name        = "dockertest-node"
  target_node = "proxmox1"                 # Change to your Proxmox node name
  #clone       = "ubuntu-22.04-cloud"  # Your base cloud-init template name
  clone = "ubuntu-cloud"

  # Activate QEMU agent for this VM
  agent = 1
  
  os_type = "cloud-init"

  cpu {
        cores = 2
        sockets = 1
        type = "host"
  }
  memory      = 2048
  scsihw      = "virtio-scsi-single"

  vga {
        type = "serial0"
  }  
  serial {
        id = 0
        type = "socket"
  }

    disks {
        ide {
            ide3 {
                cloudinit {
                    storage = "local-lvm"
                }
            }
        }
        scsi {
            scsi0 {
                disk {
                    storage = "local-lvm"
                    size    = "15G"
                    discard = true
                    iothread = true
                }
            }
        }
    }

  network {
    id = 0
    model  = "virtio"
    bridge = "vmbr0"
  }

  boot = "order=scsi0"
  ipconfig0 = "ip=dhcp"
  #ipconfig0 = "ip=10.12.1.105/24,gw=10.12.1.1"
  skip_ipv6 = true
  sshkeys = file(pathexpand("~/Terraform/dockertest/.ssh/id_rsa.pub"))

  # Here's where Docker gets installed!
  # This runs on first boot inside the VM
  #cicustom = "user=local:snippets/user-data.yaml"
  
  #cicustom = "user=local:snippets/cloud_init_test1.yml"
  cicustom = "user=Proxmox_Templates_ISOs_NFS:snippets/cloud_init_test1.yml"
}

resource "proxmox_vm_qemu" "dockertest_vm2" {
  name        = "dockertest-node2"
  target_node = "proxmox2"                 # Change to your Proxmox node name
  #clone       = "ubuntu-22.04-cloud"  # Your base cloud-init template name
  clone = "ubuntu-cloud"

  # Activate QEMU agent for this VM
  agent = 1
  
  os_type = "cloud-init"

  cpu {
        cores = 2
        sockets = 1
        type = "host"
  }
  memory      = 2048
  scsihw      = "virtio-scsi-single"

  vga {
        type = "serial0"
  }  
  serial {
        id = 0
        type = "socket"
  }

    disks {
        ide {
            ide3 {
                cloudinit {
                    storage = "local-lvm"
                }
            }
        }
        scsi {
            scsi0 {
                disk {
                    storage = "data2"
                    size    = "15G"
                    discard = true
                    iothread = true
                }
            }
        }
    }

  network {
    id = 0
    model  = "virtio"
    bridge = "vmbr0"
  }

  boot = "order=scsi0"
  ipconfig0 = "ip=dhcp"
  #ipconfig0 = "ip=10.12.1.105/24,gw=10.12.1.1"
  skip_ipv6 = true
  sshkeys = file(pathexpand("~/Terraform/dockertest/.ssh/id_rsa.pub"))

  # Here's where Docker gets installed!
  # This runs on first boot inside the VM
  #cicustom = "user=local:snippets/user-data.yaml"
  
  #cicustom = "user=local:snippets/cloud_init_test1.yml"
  cicustom = "user=Proxmox_Templates_ISOs_NFS:snippets/cloud_init_test1.yml"
}

resource "proxmox_vm_qemu" "dockertest_vm3" {
  name        = "dockertest-node3"
  target_node = "proxmox3"                 # Change to your Proxmox node name
  #clone       = "ubuntu-22.04-cloud"  # Your base cloud-init template name
  clone = "ubuntu-cloud"

  # Activate QEMU agent for this VM
  agent = 1
  
  os_type = "cloud-init"

  cpu {
        cores = 2
        sockets = 1
        type = "host"
  }
  memory      = 2048
  scsihw      = "virtio-scsi-single"

  vga {
        type = "serial0"
  }  
  serial {
        id = 0
        type = "socket"
  }

    disks {
        ide {
            ide3 {
                cloudinit {
                    storage = "local-lvm"
                }
            }
        }
        scsi {
            scsi0 {
                disk {
                    storage = "local-lvm"
                    size    = "15G"
                    discard = true
                    iothread = true
                }
            }
        }
    }

  network {
    id = 0
    model  = "virtio"
    bridge = "vmbr0"
  }

  boot = "order=scsi0"
  ipconfig0 = "ip=dhcp"
  #ipconfig0 = "ip=10.12.1.105/24,gw=10.12.1.1"
  skip_ipv6 = true
  sshkeys = file(pathexpand("~/Terraform/dockertest/.ssh/id_rsa.pub"))

  # Here's where Docker gets installed!
  # This runs on first boot inside the VM
  #cicustom = "user=local:snippets/user-data.yaml"
  
  #cicustom = "user=local:snippets/cloud_init_test1.yml"
  cicustom = "user=Proxmox_Templates_ISOs_NFS:snippets/cloud_init_test1.yml"
}
```
